{
  "name": "Paul Mouyebissi",
  "title": "Recherche Alternance en Data Sciences / IA",
  "summary": "Étudiant en 3ème année d'intelligence artificielle et Sciences de données, je compte dans mes points forts des compétences en modélisation et développement de solutions d'automatisation des processus métier grâce à l'IA. Mon raisonnement critique me permet de résoudre les problématiques avec des solutions à moindre coût et efficaces.",
  "email": "paulmouyebissi@gmail.com",
  "portfolio_url": "https://paulmouyebissi-com-e638.vercel.app/",
  "linkedin_url": "https://www.linkedin.com/in/mouyebissi-paul-655122285/",
  "photo_path": "data/img/Firefly 20240423102924.png",
  "skills": [
    "Python",
    "Pandas",
    "NumPy",
    "Matplotlib",
    "Seaborn",
    "SQL",
    "MySQL",
    "SQLite",
    "phpMyAdmin",
    "MERISE",
    "BeautifulSoup",
    "Requests",
    "R",
    "Machine Learning",
    "Time Series Analaysis (ARIMA)",
    "Régression",
    "Classification",
    "Random Forest",
    "Clustering",
    "Scikit-learn",
    "CI-CD",
    "Versionning via Github",
    "Docker"
  ],
  "soft_skills": [
    "Esprit d’analyse et de synthèse",
    "Pensée critique",
    "Attention aux détails",
    "Communication efficace",
    "Excellente Gestion du temps",
    "Ecoute attentive"
  ],
  "experiences": [
    {
      "title": "Prédiction du Bitcoin & Séries Temporelles",
      "company": "Projet Personnel",
      "period": "Juin 2025",
      "description": "Analyse et prévision du cours du Bitcoin. Mise en œuvre comparative de modèles de lissage (Moyenne Mobile Simple/SMA) et de modèles statistiques avancés (ARIMA) pour l'analyse de séries temporelles. Tests de stationnarité (Dickey-Fuller), analyse des résidus et évaluation de la précision des prédictions (RMSE)."
    },
    {
      "title": "Prédiction de Churn & Analyse RFM (E-commerce)",
      "company": "Projet Personnel (Données Olist)",
      "period": "Mai 2025",
      "description": "Développement complet d'un pipeline de Machine Learning pour prédire l'attrition client. Fusion de datasets relationnels complexes (Commandes/Paiements) et Feature Engineering basé sur la méthode RFM. Identification et correction critique de fuites de données (Data Leakage) entre Récence et Ancienneté. Modélisation via Random Forest, validée par courbes ROC-AUC et matrices de confusion."
    },
    {
      "title": "Développement d'un Studio de Thèmes VS Code",
      "company": "Projet Open Source (VS Code Theme Studio)",
      "period": "Mars 2025",
      "description": "Conception et développement d'une application web (VS Code Theme Studio) permettant la création et la personnalisation intuitive de thèmes pour l'IDE. Implémentation d'une interface dynamique pour la manipulation et la génération de fichiers JSON complexes (tokens de syntaxe). Optimisation de l'expérience développeur (DX) en simplifiant l'édition des configurations graphiques."
    },
    {
      "title": "Génération automatisée de SMS marketing avec l’IA",
      "company": "Wellpack – AI Clinic",
      "period": "Jan. 2024 -- Mar. 2024",
      "description": "J'ai été en charge d'implémenter un compteur de caractères et un moteur de troncature dynamique pour garantir des messages à minimum 160 caractères. Développé un workflow de génération de 3 variantes de SMS par requête, facilitant la comparaison d’efficacité via A/B testing. Créé un système d’export des messages générés dans un fichier JSON, servant de base à l’évaluation quantitative des performances du modèle."
    },
    {
      "title": "Analyse de Performance",
      "company": "Chips & Chicken",
      "period": "Jan. 2024 -- Mar. 2024",
      "description": "J'ai conçu un tableau de bord interactif sous Power BI réduisant de 25% le temps d’analyse manuelle. Automatisé le nettoyage et le prétraitement de données clients et transactionnelles via SQL et Pandas. Exploré les tendances de ventes et identifié des leviers de performance à l’aide de visualisations avancées, facilitant la prise de décisions stratégiques."
    },
    {
      "title": "Segmentation clients & Prédiction",
      "company": "Projet personnel",
      "period": "Avril 2025",
      "description": "Segmentation de 3000+ clients et prédiction des ventes/prix immobiliers (KMeans, PCA, t-SNE, 87% de précision). Technologies : Python, Scikit-learn, Seaborn."
    },
    {
      "title": "Analyse de sentiment Twitter",
      "company": "Projet personnel",
      "period": "Avril 2025",
      "description": "Collecte et nettoyage de 1,6 M de tweets (suppression de URLs, mentions, emojis et stopwords). Prétraitement NLP : tokenisation, lemmatisation (NLTK), vectorisation TF-IDF. Modélisation avec régression logistique (train/test 80/20) – Accuracy : 87,7%, F1-score : 74,9%."
    }
  ],
  "education": [
    {
      "institution": "Aivancity School of AI & Data Science",
      "period": "2023 - Présent",
      "degree": "3 ème année Intelligence Artificielle et Science de Données"
    },
    {
      "institution": "Lycée Jean Hilaire (Gabon)",
      "period": "Juin 2022",
      "degree": "Baccalauréat Scientifique (Mathématiques et Sciences Physiques)",
      "mention": "Mention Assez Bien"
    }
  ],
  "languages": [
    { "name": "Français", "level": "Natif" },
    { "name": "Anglais", "level": "C1" }
  ]
}
